In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("csv1.csv")

In [3]:
df2 = df.copy()

In [4]:
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [5]:
df2.groupby("country")["income"].mean()     # mean income for each country

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         NaN
USA       55400.0
Name: income, dtype: float64

In [6]:
df2.groupby("gender")["income"].mean()      # mean income for each gender

gender
Female     65666.666667
Male       54800.000000
Unknown    47000.000000
Name: income, dtype: float64

In [7]:
df2.groupby("country")["gender"].count()  # count of gender for each country

country
Canada    1
China     1
India     1
Mexico    1
Spain     1
USA       4
Name: gender, dtype: int64

In [8]:
df2.groupby("gender")["income"].max()       # max income for each gender

gender
Female     73000.0
Male       68000.0
Unknown    47000.0
Name: income, dtype: float64

In [9]:
df2.groupby("country")["income"].agg(["mean", "min", "max"])         # applies multiple aggregate functions
# df2.groupby("country")["income"].aggregate(["mean", "min", "max"])   # alias

            mean      min      max
country
Canada   62000.0  62000.0  62000.0
China    51000.0  51000.0  51000.0
India    73000.0  73000.0  73000.0
Mexico   45000.0  45000.0  45000.0
Spain        NaN      NaN      NaN
USA      55400.0  47000.0  62000.0

In [11]:
df2.groupby("country")["income"].agg(avg_salary="mean", max_salary="max")   # rename aggregate

         avg_salary  max_salary
country
Canada      62000.0     62000.0
China       51000.0     51000.0
India       73000.0     73000.0
Mexico      45000.0     45000.0
Spain           NaN         NaN
USA         55400.0     62000.0

In [12]:
df2.groupby("country").agg({
    "age": "mean",
    "income": "mean"
})   # aggregate on multiple cols

          age   income
country
Canada    NaN  62000.0
China    27.0  51000.0
India    45.0  73000.0
Mexico    NaN  45000.0
Spain    34.0      NaN
USA      29.5  55400.0

In [13]:
df2.groupby("country").agg(
    avg_age=("age", "mean"),
    avg_salary=("income", "mean")
)   # rename aggregates on multiple cols

         avg_age  avg_salary
country
Canada       NaN     62000.0
China       27.0     51000.0
India       45.0     73000.0
Mexico       NaN     45000.0
Spain       34.0         NaN
USA         29.5     55400.0